// Вывести квадрат числа

Console.Write("Введите целое число:");
int a = int.Parse(Console.ReadLine());

int quarted = a * a;

Console.WriteLine(quarted);

